In [5]:
import pandas as pd

dict_data = {'a':1, 'b':2, 'c':3}
sr = pd.Series(dict_data)

print(type(sr))
print('\n')
print(sr)
print(sr[0])
print(sr.index, sr.values)

<class 'pandas.core.series.Series'>


a    1
b    2
c    3
dtype: int64
1
Index(['a', 'b', 'c'], dtype='object') [1 2 3]

In [14]:
tup_data = ('a','2022-01-01','여',True)
sr = pd.Series(tup_data,index = ['name','date','sex','student?'])
print(sr)
print()
print(sr[[0,2]])
print()
print(sr[['name','student?']])
print('-------------------')
for idx in sr:
    print(idx)

name                 a
date        2022-01-01
sex                  여
student?          True
dtype: object

name    a
sex     여
dtype: object

name           a
student?    True
dtype: object
-------------------
a

2022-01-01

여

True

In [23]:
print(sr[0:2])
print('------------')
print(sr['name':'sex'])

name             a
date    2022-01-01
dtype: object
------------
name             a
date    2022-01-01
sex              여
dtype: object

In [25]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12]}
df = pd.DataFrame(dict_data)
print(type(df))
print('\n')
df

<class 'pandas.core.frame.DataFrame'>

   c0  c1  c2  c3
0   1   4   7  10
1   2   5   8  11
2   3   6   9  12

In [26]:
df = pd.DataFrame([[15,'남', '덕영중'],[17,'여','수리중']],
                 index = ['준서','예은'], 
                  columns = ['나이','성별','학교'])
print(df)
print('\n')
print(df.index)
print(df.columns)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중


Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [27]:
df.rename(columns={'나이':'연령','성별':'남녀','학교':'소속'}, inplace= True)
df.rename(index={'준서':'학생1', '예은':'학생2'}, inplace= True)
print(df)

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [34]:
exam_data = {'수학':[90,80,70], '영어':[98,89,95],'음악':[85,95,100],
            '체육':[100,90,90]}
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
print(df)
print('\n')
df2 = df.copy()
df2.drop('우현', inplace = True)
print(df2)
print('\n')
df3 = df.copy()
df3.drop(['우현','인아'], axis = 0 ,inplace = True)
print(df3)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90


    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90


    수학  영어  음악   체육
서준  90  98  85  100

In [35]:
df4 = df.copy()
df4.drop('수학',axis = 1, inplace=True)
print(df4)
print('\n')
df5 = df.copy()
df5.drop(['영어','음악'],axis = 1, inplace=True)
print(df5)

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90


    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [37]:
label1 = df.loc['서준']
position1 = df.iloc[0]
print(label1)
print(position1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [41]:
exam_data = {'수학':[90,80,70], '영어':[98,89,95],'음악':[85,95,100],
            '체육':[100,90,90], '이름':['서준','우현','인아']}
df = pd.DataFrame(exam_data)
df.set_index('이름',inplace= True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [43]:
g = df.loc[['서준','우현'],['음악','체육']]
print(g)
print('\n')
i = df.loc['서준':'인아','수학':'음악']
print(i)
print('\n')
j = df.iloc[0:2,2:]
print(j)

    음악   체육
이름
서준  85  100
우현  95   90


    수학  영어   음악
이름
서준  90  98   85
우현  80  89   95
인아  70  95  100


    음악   체육
이름
서준  85  100
우현  95   90

In [45]:
df.loc['수영'] = ['99','100','98','97']
df

    수학   영어   음악   체육
이름
서준  90   98   85  100
우현  80   89   95   90
인아  70   95  100   90
수영  99  100   98   97

In [64]:
df.index('이름') = '수혁'
df

SyntaxError: can't assign to function call (<ipython-input-64-cd8d40fb34d6>, line 1)

In [11]:
import pandas as pd
import numpy as np
from flask import Flask
from urllib import request #1
from bs4 import BeautifulSoup
city_list = []
output_1 = []
output_2 = []
output_3 = []
temp_list = []
w_dict = {}
app = Flask(__name__)
@app.route('/')
def hello():
    url = 'https://www.weather.go.kr/w/weather/forecast/mid-term.do?stnId=108'
    target = request.urlopen(url)
    soup = BeautifulSoup(target)
    
    output = " "
    for location in soup.find_all('tr'):
#         output = " "
        if location.find('td',class_='midterm-city'):
            output_1_1 = "<h3>{}</h3>".format(\
                                           location.find('td',class_='midterm-city').text)
            city_list.append(location.find('td',class_='midterm-city').text)
            output_1.append(output_1_1)
            
            output_3_3 = "최저/최고 기온: {}/{}".format(\
                                            location.find('span',class_='tmn').text,\
                                            location.find('span',class_='tmx').text)
            output_3.append(output_3_3)
            
        if location.find('td') and location.select_one('img'):
#             print(location)
            data = location.select_one('img').attrs['title']
            temp_list.append(data)
            
#   도시와 날씨의 짝을 맞춰주는 부분. // 실시간 데이터 받기   
    for i in range(0,6): 
        w_dict[city_list[i]]=temp_list[0]
    for i in range(6,8):
        w_dict[city_list[i]]=temp_list[1]
    for i in range(8,9):
        w_dict[city_list[i]]= temp_list[2]
    for i in range(9,12):
        w_dict[city_list[i]]= temp_list[3]
    for i in range(12,15):
        w_dict[city_list[i]]= temp_list[4]
    for i in range(15,21):
        w_dict[city_list[i]]= temp_list[5]
    for i in range(21,27):
        w_dict[city_list[i]]= temp_list[6]
    for i in range(27,33,1):
        w_dict[city_list[i]]= temp_list[7]
    for i in range(33,39,1):
        w_dict[city_list[i]]= temp_list[8]
    for i in range(39,41,1):
        w_dict[city_list[i]]= temp_list[9]
    for key, value in w_dict.items():
        output_2_2 = "{}".format(value)
        output_2.append(output_2_2)
    for idx, value in enumerate(output_1):
        output += output_1[idx]
        output += output_2[idx]
        output += output_3[idx]
    return output
hello()

' <h3>서울</h3>구름많음최저/최고 기온: -7/2<h3>인천</h3>구름많음최저/최고 기온: -7/1<h3>수원</h3>구름많음최저/최고 기온: -8/2<h3>파주</h3>구름많음최저/최고 기온: -11/2<h3>이천</h3>구름많음최저/최고 기온: -9/3<h3>평택</h3>구름많음최저/최고 기온: -8/2<h3>춘천</h3>구름많음최저/최고 기온: -10/2<h3>원주</h3>구름많음최저/최고 기온: -9/3<h3>강릉</h3>구름많음최저/최고 기온: -3/6<h3>대전</h3>구름많음최저/최고 기온: -7/4<h3>세종</h3>구름많음최저/최고 기온: -9/3<h3>홍성</h3>구름많음최저/최고 기온: -8/2<h3>청주</h3>구름많음최저/최고 기온: -7/3<h3>충주</h3>구름많음최저/최고 기온: -10/3<h3>영동</h3>구름많음최저/최고 기온: -10/5<h3>광주</h3>구름많음최저/최고 기온: -4/6<h3>목포</h3>구름많음최저/최고 기온: -3/3<h3>여수</h3>구름많음최저/최고 기온: -1/6<h3>순천</h3>구름많음최저/최고 기온: -3/7<h3>광양</h3>구름많음최저/최고 기온: -2/7<h3>나주</h3>구름많음최저/최고 기온: -6/4<h3>전주</h3>구름많음최저/최고 기온: -5/4<h3>군산</h3>구름많음최저/최고 기온: -5/4<h3>정읍</h3>구름많음최저/최고 기온: -6/4<h3>남원</h3>구름많음최저/최고 기온: -6/6<h3>고창</h3>구름많음최저/최고 기온: -5/4<h3>무주</h3>구름많음최저/최고 기온: -9/5<h3>부산</h3>구름많음최저/최고 기온: 0/9<h3>울산</h3>구름많음최저/최고 기온: -3/7<h3>창원</h3>구름많음최저/최고 기온: -4/6<h3>진주</h3>구름많음최저/최고 기온: -7/6<h3>거창</h3>구름많음최저/최고 기온: -8/6<h3>통영</h3>구름많음최저/최고 기온: -2/8<h3>대구</h3>구름많음최저/최고 기온: -6/5<h3>안동</h3>구름많음최저/최고 기온: -9/5<h3>포항</h3>구름많음최저/최고 기온: -3/7<h3>경주</h3>구름많음최저/최고 기온: -5/8<h3>울진</h3>구름많음최저/최고 기온: -3/6<h3>울릉도</h3>구름많음최저/최고 기온: -1/4<h3>제주</h3>구름많음최저/최고 기온: 3/9<h3>서귀포</h3>구름많음최저/최고 기온: 5/10'

In [26]:
import pandas as pd
df3 = pd.DataFrame([output_2],columns = city_list, index = ['날씨'])
df3.loc['기온'] = output_3
df3

,서울,인천,수원,파주,이천,평택,춘천,원주,강릉,대전,...,거창,통영,대구,안동,포항,경주,울진,울릉도,제주,서귀포
날씨,구름많음,구름많음,구름많음,구름많음,구름많음,구름많음,구름많음,구름많음,구름많음,구름많음,...,구름많음,구름많음,구름많음,구름많음,구름많음,구름많음,구름많음,구름많음,구름많음,구름많음
기온,최저/최고 기온: -7/2,최저/최고 기온: -7/1,최저/최고 기온: -8/2,최저/최고 기온: -11/2,최저/최고 기온: -9/3,최저/최고 기온: -8/2,최저/최고 기온: -10/2,최저/최고 기온: -9/3,최저/최고 기온: -3/6,최저/최고 기온: -7/4,...,최저/최고 기온: -8/6,최저/최고 기온: -2/8,최저/최고 기온: -6/5,최저/최고 기온: -9/5,최저/최고 기온: -3/7,최저/최고 기온: -5/8,최저/최고 기온: -3/6,최저/최고 기온: -1/4,최저/최고 기온: 3/9,최저/최고 기온: 5/10

In [24]:
a_list = [1,2,3,4,5]
df_a = pd.DataFrame([a_list], columns = [0,1,2,3,4])
print(df_a)
print('\n')
df_a_1 = pd.DataFrame(a_list)
print(df_a_1)

   0  1  2  3  4
0  1  2  3  4  5


   0
0  1
1  2
2  3
3  4
4  5

In [37]:
students = [{'name':'윤인성','국어':87,'수학':98,'영어':88,'과학':95},
           {'name':'연하진','국어':92,'수학':98,'영어':96,'과학':98},
           {'name':'구지연','국어':76,'수학':96,'영어':94,'과학':90},
           {'name':'나선주','국어':98,'수학':92,'영어':96,'과학':92},
           {'name':'윤아린','국어':95,'수학':98,'영어':98,'과학':98},
           {'name':'윤인성','국어':64,'수학':88,'영어':92,'과학':92}]
print('이름','총점','평균',sep = '\t')
for student in students:
    score_sum = studnet['국어'] + studnet['수학'] + studnet['영어'] + student['과학']
    score_average = score_sum / 4
    print(studnet['name'],score_sum,score_average, sep = '\t')

이름	총점	평균
윤인성	368	92.0
윤인성	371	92.75
윤인성	363	90.75
윤인성	365	91.25
윤인성	371	92.75
윤인성	365	91.25

In [ ]:
def create_studnet(name, kor, mat, eng, sci):
    return {'name' : name,
           'kor' : kor,
           'mat' : mat,
           'eng' : eng,
           'sci' : sci}

In [ ]:
students = [create_student('윤인성', 87, 98, 88, 95),
            create_student('연하진', 87, 98, 88, 95),
           create_student('구지연', 87, 98, 88, 95),
           create_student('나선주', 87, 98, 88, 95),
           create_student('윤아린', 87, 98, 88, 95),
           create_student('윤명월', 87, 98, 88, 95)]

In [43]:
#1.
print('hello world')
#2
print("Mary's cosmetics")
#3
print('신씨가 소리질렀다. "도둑이야".')

hello world
Mary's cosmetics
신씨가 소리질렀다. "도둑이야".

In [45]:
print('naver','kakao','sk;samsung', sep = ';')

naver;kakao;sk;samsung

In [65]:
# 민우는 자신이 구매했던 로또로 당첨이 가능했던 최고 순위와
# 최저 순위를 알아보고 싶어 졌습니다.
# 민우가 구매한 로또 번호를 담은 배열 lottos, 당첨 번호를 담은 배열 
# win_nums가 매개변수로 주어집니다. 이때, 당첨 가능한 최고 순위와 
# 최저 순위를 차례대로 배열에 담아서 return 하도록 solution 함수를 완성해주세요
def solution(lottos, win_nums):
    answer = [0,0]
    count = 0
    count1 = 0
    for i in range(6):
        if win_nums[i] in lottos:
            count+=1
        if lottos[i] == 0:
            count1+=1
    if count >= 2:
        answer[1] = 6 - (count-1)
    else:
        answer[1] = 6
    if count1 == 0:
        if count > 1:
            answer[0] = 6 - (count-1)
        else:
            answer[0] = 6
    if count1 == 1:
        if 1<= count <= 5:
            answer[0] = answer[1] -1
        elif count==0:
            answer[0] = 6
        else:
            answer[0] = 1
    if count1 == 2:
        if 1 <= count <= 4:
            answer[0] = answer[1]-2
        elif count == 0:
            answer[0] = 5
        else:
            answer[0] = 1
    if count1 == 3:
        if 1<= count <= 3:
            answer[0] = answer[1]-3
        elif count == 0:
            answer[0] = 4
        else:
            answer[0] = 1
    if count1 == 4:
        if 1<= count <=2:
            answer[0] = answer[1] - 4
        elif count == 0:
            answer[0] = 3
        else:
            answer[0] = 1
    if count1 == 5:
        if count == 0:
            answer[0] = 2
        else:
            answer[0] = 1
    if count1 == 6:
        answer[0] = 1
    return answer, count, count1

In [66]:
win_nums = [31,10,45,1,6,19]
lottos = [21,10,0,0,1,6]
print(solution(lottos, win_nums))

([2, 4], 3, 2)

# 아이디의 길이는 3자 이상 15자 이하여야 합니다.
# 아이디는 알파벳 소문자, 숫자, 빼기(-), 밑줄(_),
# 마침표(.) 문자만 사용할 수 있습니다.
# 단, 마침표(.)는 처음과 끝에 사용할 수 없으며
# 또한 연속으로 사용할 수 없습니다.
- 1단계 new_id의 모든 대문자를 대응되는 소문자로 치환합니다.
- 2단계 new_id에서 알파벳 소문자, 숫자, 빼기(-), 밑줄(_), 마침표(.)를 제외한 모든 문자를 제거합니다.
- 3단계 new_id에서 마침표(.)가 2번 이상 연속된 부분을 하나의 마침표(.)로 치환합니다.
- 4단계 new_id에서 마침표(.)가 처음이나 끝에 위치한다면 제거합니다.
- 5단계 new_id가 빈 문자열이라면, new_id에 "a"를 대입합니다.
- 6단계 new_id의 길이가 16자 이상이면, new_id의 첫 15개의 문자를 제외한 나머지 문자들을 모두 제거합니다.
- 만약 제거 후 마침표(.)가 new_id의 끝에 위치한다면 끝에 위치한 마침표(.) 문자를 제거합니다.
- 7단계 new_id의 길이가 2자 이하라면, new_id의 마지막 문자를 new_id의 길이가 3이 될 때까지 반복해서 끝에 붙입니다.

In [ ]:
def solution(new_id):
    answer = ''
    if len(new_id)<3 or len(new_id)>15:
        answer = '아이디는 3자 이상 15자 이하여야 합니다.'
    new = new_id.lower()
    
    return answer

In [2]:
a = 'A1@,3'
print(a.lower())

a1@,3